app/views/groups/_filter_results.html.erb

            <div>
              <% if Membership.where(group_id: group.id).count > 1 %>
                <%= Membership.where(group_id: group.id).count %> Members
              <% else %>
                <%= Membership.where(group_id: group.id).count %> Member
---
SELECT COUNT(*) FROM "memberships" WHERE "memberships"."group_id" = $1  [["group_id", 1]]

            <div>
              <% if Post.where(group_id: group.id).count > 1 %>
                <%= Post.where(group_id: group.id).count %> Posts
              <% else %>
                <%= Post.where(group_id: group.id).count %> Post
---
SELECT "posts".* FROM "posts" WHERE "posts"."group_id" = $1 ORDER BY "posts"."updated_at" DESC LIMIT $2  [["group_id", 1], ["LIMIT", 1]]
SELECT COUNT(*) FROM "posts" WHERE "posts"."group_id" = $1  [["group_id", 1]]
SELECT COUNT(*) FROM "posts" WHERE "posts"."group_id" = $1  [["group_id", 2]]

              <%# Save date of latest reply %>
              <% if Reply.where(group_id: group.id).present? %>
                <% latest_reply = Reply.where(group_id: group.id).order(updated_at: :desc).first.updated_at.to_i %>
---
SELECT "replies".* FROM "replies" WHERE "replies"."group_id" = $1  [["group_id", 1]]
SELECT "replies".* FROM "replies" WHERE "replies"."group_id" = $1 ORDER BY "replies"."updated_at" DESC LIMIT $2  [["group_id", 1], ["LIMIT", 1]]

              <%# Save date of latest comment %>
              <% if Comment.where(group_id: group.id).present? %>
                <% latest_comment = Comment.where(group_id: group.id).order(updated_at: :desc).first.updated_at.to_i %>
---
SELECT "comments".* FROM "comments" WHERE "comments"."group_id" = $1  [["group_id", 1]]
SELECT "comments".* FROM "comments" WHERE "comments"."group_id" = $1 ORDER BY "comments"."updated_at" DESC LIMIT $2  [["group_id", 1], ["LIMIT", 1]]

              <%# Save date of latest post %>
              <% if Post.where(group_id: group.id).present? %>
                <% latest_post = Post.where(group_id: group.id).order(updated_at: :desc).first.updated_at.to_i %>
---
SELECT "posts".* FROM "posts" WHERE "posts"."group_id" = $1  [["group_id", 1]]
SELECT "posts".* FROM "posts" WHERE "posts"."group_id" = $1 ORDER BY "posts"."updated_at" DESC LIMIT $2  [["group_id", 1], ["LIMIT", 1]]

      <%# Join and Visit button logic %>
      <% if Membership.where(group_id: group.id).where(user_id: current_user.id).present? %>
---
SELECT "memberships".* FROM "memberships" WHERE "memberships"."group_id" = $1 AND "memberships"."user_id" = $2  [["group_id", 1], ["user_id", 1]]