app/views/groups/_filter_results.html.erb

SELECT "memberships".* FROM "memberships" WHERE "memberships"."group_id" = $1 AND "memberships"."user_id" = $2  [["group_id", 1], ["user_id", 1]]
---

    <% if Membership.where(group_id: group.id).where(user_id: current_user.id).present? %>