app/views/groups/_group_posts.html.erb

SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = $1  [["post_id", 5]]
SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = $1 ORDER BY "comments"."updated_at" ASC LIMIT $2  [["post_id", 1], ["LIMIT", 1]]
---
            <%# Time of Last comment  %>
            <% if Comment.where(post_id: post.id).present? %>
                Last comment
                <%= time_ago_in_words(Comment.where(post_id: post.id).order(updated_at: :desc).last.updated_at) %>

SELECT "users".* FROM "users" WHERE "users"."id" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
            <% else %>
                <%= User.where(id: post.user_id).first.name %>