app/views/groups/_group.html.erb

SELECT COUNT(*) FROM "memberships" WHERE "memberships"."group_id" = $1  [["group_id", 1]]
SELECT COUNT(*) FROM "memberships" WHERE "memberships"."group_id" = $1  [["group_id", 5]]
---
      <div>
        <% if Membership.where(group_id: group.id).count > 0 %>
          <%= Membership.where(group_id: group.id).count %> Members
        <% else %>
          <%= Membership.where(group_id: group.id).count %> Member

SELECT "posts".* FROM "posts" WHERE "posts"."group_id" = $1 ORDER BY "posts"."updated_at" ASC LIMIT $2  [["group_id", 1], ["LIMIT", 1]]
SELECT COUNT(*) FROM "posts" WHERE "posts"."group_id" = $1  [["group_id", 1]]
SELECT COUNT(*) FROM "memberships" WHERE "memberships"."group_id" = $1  [["group_id", 2]]
SELECT COUNT(*) FROM "memberships" WHERE "memberships"."group_id" = $1  [["group_id", 1]]
---
      <div>
        <% if Post.where(group_id: group.id).count > 0 %>
          <%= Membership.where(group_id: group.id).count %> Posts
        <% else %>
          <%= Membership.where(group_id: group.id).count %> Post

SELECT "replies".* FROM "replies" WHERE "replies"."group_id" = $1  [["group_id", 1]]
SELECT "replies".* FROM "replies" WHERE "replies"."group_id" = $1 ORDER BY "replies"."updated_at" ASC LIMIT $2  [["group_id", 1], ["LIMIT", 1]]
---

        <% if Reply.where(group_id: group.id).present? %>
          <% latest_reply = Reply.where(group_id: group.id).order(updated_at: :desc).last.updated_at %>

SELECT "comments".* FROM "comments" WHERE "comments"."group_id" = $1  [["group_id", 1]]
SELECT "comments".* FROM "comments" WHERE "comments"."group_id" = $1 ORDER BY "comments"."updated_at" ASC LIMIT $2  [["group_id", 1], ["LIMIT", 1]]
---

        <% if Comment.where(group_id: group.id).present? %>
          <% latest_comment = Comment.where(group_id: group.id).order(updated_at: :desc).last.updated_at %>

SELECT "posts".* FROM "posts" WHERE "posts"."group_id" = $1  [["group_id", 1]]
SELECT "posts".* FROM "posts" WHERE "posts"."group_id" = $1 ORDER BY "posts"."updated_at" ASC LIMIT $2  [["group_id", 1], ["LIMIT", 1]]
---

        <% if Post.where(group_id: group.id).present? %>
          <% latest_post = Post.where(group_id: group.id).order(updated_at: :desc).last.updated_at %>

SELECT "memberships".* FROM "memberships" WHERE "memberships"."group_id" = $1 AND "memberships"."user_id" = $2  [["group_id", 1], ["user_id", 1]]
---
  <div>
    <% if Membership.where(group_id: group.id).where(user_id: current_user.id).present? %>