app/views/groups/show.html.erb

          <% if current_user.id == member.id || current_user.id == @group.user_id %>
            <%= form_with(model: Membership.find(@query.where(user_id: member.id).first.id), method: :delete) do |form| %>
---
SELECT "memberships".* FROM "memberships" WHERE "memberships"."group_id" = $1 AND "memberships"."user_id" = $2 ORDER BY "memberships"."id" ASC LIMIT $3  [["group_id", 1], ["user_id", 1], ["LIMIT", 1]]