app/views/posts/_comment.html.erb

        <% else %>
            <%= User.where(id: comment.user_id).first.name %>
        <% end %>
        commented <%= time_ago_in_words(Comment.where(id: comment.id).last.updated_at) %> ago   •
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["id", 2], ["LIMIT", 1]]
SELECT "comments".* FROM "comments" WHERE "comments"."id" = $1 ORDER BY "comments"."id" DESC LIMIT $2  [["id", 8], ["LIMIT", 1]]