app/views/posts/_replies.html.erb

SELECT "users".* FROM "users" WHERE "users"."id" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "replies".* FROM "replies" WHERE "replies"."id" = $1 ORDER BY "replies"."id" DESC LIMIT $2  [["id", 7], ["LIMIT", 1]]
---
      <% else %>
        <%= User.where(id: reply.user_id).first.name %>
      <% end %>
      replied <%= time_ago_in_words(Reply.where(id: reply.id).last.updated_at) %> ago •