app/controllers/comments_controller.rb

  def create
    @comment = Comment.new(comment_params)

    respond_to do |format|
      if @comment.save
---
INSERT INTO "comments" ("remark", "created_at", "updated_at", "post_id", "group_id", "user_id") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["remark", "commting one"], ["created_at", "2023-01-29 07:13:43.814692"], ["updated_at", "2023-01-29 07:13:43.814692"], ["post_id", 1], ["group_id", 1], ["user_id", 1]]

  def destroy

    replies = Reply.where(comment_id: @comment.id)

    if replies.count > 0
      replies.each do |reply|
        reply.destroy
      end
    end

    @comment.destroy
---
SELECT "replies".* FROM "replies" WHERE "replies"."comment_id" = $1  [["comment_id", 3]]
SELECT COUNT(*) FROM "replies" WHERE "replies"."comment_id" = $1  [["comment_id", 3]]
DELETE FROM "replies" WHERE "replies"."id" = $1  [["id", 3]]
DELETE FROM "comments" WHERE "comments"."id" = $1  [["id", 3]]