app/controllers/groups_controller.rb

  def filter
    if params[:filter] == "all"
      @groups = Group.all
    elsif params[:filter] == "mine"
      @groups = Group.where(user_id: current_user.id)
    elsif params[:filter] == "joined"
      query = Membership.where(user_id: current_user.id)
      list = []
      query.each { |q| list.push(q.group_id) }
---
SELECT "groups".* FROM "groups"
SELECT "groups".* FROM "groups" WHERE "groups"."user_id" = $1  [["user_id", 2]]
SELECT "memberships".* FROM "memberships" WHERE "memberships"."group_id" = $1 AND "memberships"."user_id" = $2  [["group_id", 1], ["user_id", 1]]
SELECT "groups".* FROM "groups" WHERE "groups"."id" IN ($1, $2)  [["id", 1], ["id", 2]]
SELECT "memberships".* FROM "memberships" WHERE "memberships"."user_id" = $1  [["user_id", 1]]

  def index
    @groups = Group.all
---
SELECT "groups".* FROM "groups" ORDER BY "groups"."id" ASC LIMIT $1  [["LIMIT", 1]]

  def show
    @posts = Post.where(group_id: @group.id)

    @query = Membership.where(group_id: @group.id)
    list = []
    @query.each { |q| list.push(q.user_id) }
---
SELECT "posts".* FROM "posts" WHERE "posts"."group_id" = $1  [["group_id", 5]]
SELECT "memberships".* FROM "memberships" WHERE "memberships"."group_id" = $1  [["group_id", 3]]
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "memberships".* FROM "memberships" WHERE "memberships"."group_id" = $1  [["group_id", 1]]

  def create
    @group = Group.new(group_params)

    respond_to do |format|
      if @group.save
        Membership.create!(user_id: current_user.id, group_id: @group.id )
---
INSERT INTO "groups" ("name", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "Mega evolutions"], ["created_at", "2023-01-29 06:29:24.600566"], ["updated_at", "2023-01-29 06:29:24.600566"], ["user_id", 1]]
INSERT INTO "memberships" ("group_id", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["group_id", 5], ["user_id", 2], ["created_at", "2023-01-29 12:04:26.883927"], ["updated_at", "2023-01-29 12:04:26.883927"]]

  def update
    respond_to do |format|
      if @group.update(group_params)
---
UPDATE "groups" SET "name" = $1, "updated_at" = $2, "user_id" = $3 WHERE "groups"."id" = $4  [["name", "Calvin's Teaching Groups 2"], ["updated_at", "2023-01-29 11:36:03.445996"], ["user_id", 2], ["id", 1]]