app/controllers/memberships_controller.rb

SELECT "memberships".* FROM "memberships"
---
  def index
    @memberships = Membership.all

INSERT INTO "memberships" ("group_id", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["group_id", 3], ["user_id", 1], ["created_at", "2023-01-28 11:00:15.589319"], ["updated_at", "2023-01-28 11:00:15.589319"]]
---
  def create
    @membership = Membership.new(membership_params)

    respond_to do |format|
      if @membership.save

DELETE FROM "memberships" WHERE "memberships"."id" = $1  [["id", 3]]
---
  def destroy
    @membership.destroy

SELECT "memberships".* FROM "memberships" WHERE "memberships"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]
---
    def set_membership
      @membership = Membership.find(params[:id])