app/controllers/posts_controller.rb

  def show
    @comments = Comment.where(post_id: @post.id)
    @replies = Reply.where(post_id: @post.id )
    @group = Group.where(id: @post.group_id).first
---
SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = $1  [["post_id", 1]]
SELECT "replies".* FROM "replies" WHERE "replies"."post_id" = $1 AND "replies"."comment_id" = $2  [["post_id", 3], ["comment_id", 3]]
SELECT "comments".* FROM "comments" WHERE "comments"."id" = $1 ORDER BY "comments"."id" DESC LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "replies".* FROM "replies" WHERE "replies"."id" = $1 ORDER BY "replies"."id" DESC LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "groups".* FROM "groups" WHERE "groups"."id" = $1 ORDER BY "groups"."id" ASC LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def create
    @post = Post.new(post_params)

    respond_to do |format|
      if @post.save
---
INSERT INTO "posts" ("title", "content", "created_at", "updated_at", "group_id", "user_id") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"

  def update
    respond_to do |format|
      if @post.update(post_params)
---
UPDATE "posts" SET "content" = $1, "updated_at" = $2 WHERE "posts"."id" = $3

  def destroy

    id = @post.id

    replies = Reply.where(post_id: @post.id)
    if replies.count > 0
      replies.each do |reply|
        reply.destroy
      end
    end


    comments = Comment.where(post_id: @post.id)
    if comments.count > 0
      comments.each do |comment|
        comment.destroy
      end
    end

    @post.destroy
---
SELECT "replies".* FROM "replies" WHERE "replies"."post_id" = $1  [["post_id", 3]]
SELECT COUNT(*) FROM "replies" WHERE "replies"."post_id" = $1  [["post_id", 5]]
DELETE FROM "replies" WHERE "replies"."id" = $1  [["id", 7]]
SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = $1  [["post_id", 3]]
SELECT COUNT(*) FROM "comments" WHERE "comments"."post_id" = $1  [["post_id", 5]]
DELETE FROM "comments" WHERE "comments"."id" = $1  [["id", 4]]
DELETE FROM "posts" WHERE "posts"."id" = $1  [["id", 5]]