app/controllers/replies_controller.rb

  def index
    @replies = Reply.all
---
SELECT "replies".* FROM "replies"

  def create
    @reply = Reply.new(reply_params)

    respond_to do |format|
      if @reply.save
---
INSERT INTO "replies" ("feedback", "comment_id", "created_at", "updated_at", "post_id", "group_id", "user_id") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["feedback", "shyper"], ["comment_id", 1], ["created_at", "2023-01-29 07:16:06.866464"], ["updated_at", "2023-01-29 07:16:06.866464"], ["post_id", 1], ["group_id", 1], ["user_id", 2]]

  def destroy
    id = @reply.id
    @reply.destroy
---
DELETE FROM "replies" WHERE "replies"."id" = $1  [["id", 7]]

    def set_reply
      @reply = Reply.find(params[:id])
---
SELECT "replies".* FROM "replies" WHERE "replies"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]